; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	image2 - mode
	image3 - mode
	image0 - mode
	infrared1 - mode
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star1 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Star20 - direction
	Planet21 - direction
	Planet22 - direction
	Phenomenon23 - direction
	Phenomenon24 - direction
	Star25 - direction
	Planet26 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image3)
	(supports instrument1 image0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star1)
	(supports instrument2 image3)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument3 image3)
	(supports instrument3 image0)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 infrared1)
	(supports instrument4 image2)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument5 image0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star1)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument6 image2)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet22)
	(supports instrument9 image0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 infrared1)
	(supports instrument10 image0)
	(supports instrument10 image3)
	(calibration_target instrument10 Star1)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet26)
)
(:goal (and
	(pointing satellite1 Star14)
	(have_image Planet5 image0)
	(have_image Phenomenon6 image3)
	(have_image Planet7 infrared1)
	(have_image Star8 infrared1)
	(have_image Star9 image3)
	(have_image Planet11 image3)
	(have_image Star12 image3)
	(have_image Planet13 infrared1)
	(have_image Star14 image2)
	(have_image Planet15 image3)
	(have_image Phenomenon16 image0)
	(have_image Planet17 infrared1)
	(have_image Phenomenon18 image2)
	(have_image Star19 image0)
	(have_image Star20 image2)
	(have_image Planet21 image2)
	(have_image Planet22 image0)
	(have_image Phenomenon23 image2)
	(have_image Phenomenon24 image2)
	(have_image Star25 image0)
	(have_image Planet26 image3)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 22
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 22
3. (turn_to satellite4 star1 planet26)
   deleted: (pointing satellite4 planet26)
   added: (pointing satellite4 star1)
   goals met: 0 of 22
4. (calibrate satellite4 instrument10 star1)
   added: (calibrated instrument10)
   goals met: 0 of 22
5. (turn_to satellite4 phenomenon16 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon16)
   goals met: 0 of 22
6. (take_image satellite4 phenomenon16 instrument10 image0)
   added: (have_image phenomenon16 image0)
   goals met: 1 of 22
7. (turn_to satellite4 phenomenon6 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 phenomenon6)
   goals met: 1 of 22
8. (take_image satellite4 phenomenon6 instrument10 image3)
   added: (have_image phenomenon6 image3)
   goals met: 2 of 22
9. (turn_to satellite4 planet11 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 planet11)
   goals met: 2 of 22
10. (take_image satellite4 planet11 instrument10 image3)
   added: (have_image planet11 image3)
   goals met: 3 of 22
11. (turn_to satellite4 planet13 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet13)
   goals met: 3 of 22
12. (take_image satellite4 planet13 instrument10 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 4 of 22
13. (turn_to satellite4 planet15 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet15)
   goals met: 4 of 22
14. (take_image satellite4 planet15 instrument10 image3)
   added: (have_image planet15 image3)
   goals met: 5 of 22
15. (turn_to satellite4 planet17 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet17)
   goals met: 5 of 22
16. (take_image satellite4 planet17 instrument10 infrared1)
   added: (have_image planet17 infrared1)
   goals met: 6 of 22
17. (turn_to satellite4 planet22 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet22)
   goals met: 6 of 22
18. (take_image satellite4 planet22 instrument10 image0)
   added: (have_image planet22 image0)
   goals met: 7 of 22
19. (turn_to satellite4 planet26 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 planet26)
   goals met: 7 of 22
20. (take_image satellite4 planet26 instrument10 image3)
   added: (have_image planet26 image3)
   goals met: 8 of 22
21. (turn_to satellite4 planet5 planet26)
   deleted: (pointing satellite4 planet26)
   added: (pointing satellite4 planet5)
   goals met: 8 of 22
22. (take_image satellite4 planet5 instrument10 image0)
   added: (have_image planet5 image0)
   goals met: 9 of 22
23. (turn_to satellite4 planet7 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 planet7)
   goals met: 9 of 22
24. (take_image satellite4 planet7 instrument10 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 10 of 22
25. (turn_to satellite4 star12 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star12)
   goals met: 10 of 22
26. (take_image satellite4 star12 instrument10 image3)
   added: (have_image star12 image3)
   goals met: 11 of 22
27. (turn_to satellite4 star19 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 star19)
   goals met: 11 of 22
28. (take_image satellite4 star19 instrument10 image0)
   added: (have_image star19 image0)
   goals met: 12 of 22
29. (turn_to satellite4 star25 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star25)
   goals met: 12 of 22
30. (take_image satellite4 star25 instrument10 image0)
   added: (have_image star25 image0)
   goals met: 13 of 22
31. (turn_to satellite4 star8 star25)
   deleted: (pointing satellite4 star25)
   added: (pointing satellite4 star8)
   goals met: 13 of 22
32. (take_image satellite4 star8 instrument10 infrared1)
   added: (have_image star8 infrared1)
   goals met: 14 of 22
33. (turn_to satellite4 star9 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 star9)
   goals met: 14 of 22
34. (take_image satellite4 star9 instrument10 image3)
   added: (have_image star9 image3)
   goals met: 15 of 22
35. (turn_to satellite1 groundstation4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation4)
   goals met: 15 of 22
36. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 15 of 22
37. (turn_to satellite1 phenomenon18 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon18)
   goals met: 15 of 22
38. (take_image satellite1 phenomenon18 instrument3 image2)
   added: (have_image phenomenon18 image2)
   goals met: 16 of 22
39. (turn_to satellite1 phenomenon23 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 phenomenon23)
   goals met: 16 of 22
40. (take_image satellite1 phenomenon23 instrument3 image2)
   added: (have_image phenomenon23 image2)
   goals met: 17 of 22
41. (turn_to satellite1 phenomenon24 phenomenon23)
   deleted: (pointing satellite1 phenomenon23)
   added: (pointing satellite1 phenomenon24)
   goals met: 17 of 22
42. (take_image satellite1 phenomenon24 instrument3 image2)
   added: (have_image phenomenon24 image2)
   goals met: 18 of 22
43. (turn_to satellite1 planet21 phenomenon24)
   deleted: (pointing satellite1 phenomenon24)
   added: (pointing satellite1 planet21)
   goals met: 18 of 22
44. (take_image satellite1 planet21 instrument3 image2)
   added: (have_image planet21 image2)
   goals met: 19 of 22
45. (turn_to satellite1 star14 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 star14)
   goals met: 20 of 22
46. (take_image satellite1 star14 instrument3 image2)
   added: (have_image star14 image2)
   goals met: 21 of 22
47. (turn_to satellite1 star20 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star20)
   goals met: 20 of 22
48. (take_image satellite1 star20 instrument3 image2)
   added: (have_image star20 image2)
   goals met: 21 of 22
49. (turn_to satellite1 star14 star20)
   deleted: (pointing satellite1 star20)
   added: (pointing satellite1 star14)
   goals met: 22 of 22
